Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: This check includes language specific rules to avoid false positives. In case it triggers falsely in your case, let us know. See :ref:`report-issue`.
sv: Denna kontroll inkluderar sprÃ¥kspecifika regler fÃ¶r att undvika falska positiva resultat. Om den utlÃ¶ser falska positiva resultat i ditt fall, vÃ¤nligen meddela oss. Se :ref:`report-issue`.

source: This check has to be turned on using ``check-glossary`` flag (see :ref:`custom-checks`). Please consider following prior to enabling it:
sv: Denna kontroll mÃ¥ste aktiveras med flaggan ``check-glossary`` (se :ref:`custom-checks`). TÃ¤nk pÃ¥ fÃ¶ljande innan du aktiverar den:

source: It does exact string matching, the glossary is expected to contain terms in all variants.
sv: Den utfÃ¶r exakt strÃ¤ngmatchning, och ordlistan fÃ¶rvÃ¤ntas innehÃ¥lla termer i alla varianter.

source: Checking each string against glossary is expensive, it will slow down any operation in Weblate which involves running checks like importing strings or translating.
sv: Att kontrollera varje strÃ¤ng mot ordlistan Ã¤r kostsamt och kommer att sakta ner alla operationer i Weblate som involverar kontroller, sÃ¥som import av strÃ¤ngar eller Ã¶versÃ¤ttning.

source: It also utilizes untranslatable glossary terms in :ref:`check-same`.
sv: Den anvÃ¤nder ocksÃ¥ oÃ¶versÃ¤ttbara termer i :ref:`check-same`.

source: Checks that double space is present in translation to avoid false positives on other space-related checks.
sv: Kontrollerar att dubbla mellanslag fÃ¶rekommer i Ã¶versÃ¤ttningen fÃ¶r att undvika falska positiva resultat vid andra mellanslagsrelaterade kontroller.

source: Check is false when double space is found in source meaning double space is intentional.
sv: Kontrollen Ã¤r falsk nÃ¤r dubbla mellanslag hittas i kÃ¤llan, vilket innebÃ¤r att dubbla mellanslag Ã¤r avsiktliga.

source: File formats automatically enabling this check
sv: Filformat som automatiskt aktiverar denna kontroll

source: Each Fluent Message can have an optional value (the main text content), and optional attributes, each of which is a "part" of the Message. In Weblate, all these parts appear within the same block, using Fluent-like syntax to specify the attributes. For example:
sv: Varje Fluent-meddelande kan ha ett valfritt vÃ¤rde (huvudtexten) och valfria attribut, som var och en Ã¤r en "del" av meddelandet. I Weblate visas alla dessa delar i samma block, med Fluent-liknande syntax fÃ¶r att ange attributen. Till exempel:

source: This check ensures that the translated Message also has a value if the source Message has one, or no value if the source has none. This also checks that the same attributes used in the source Message also appear in the translation, with no additions.
sv: Denna kontroll sÃ¤kerstÃ¤ller att det Ã¶versatta meddelandet ocksÃ¥ har ett vÃ¤rde om kÃ¤llmeddelandet har ett, eller inget vÃ¤rde om kÃ¤llmeddelandet inte har nÃ¥got. Detta kontrollerar ocksÃ¥ att samma attribut som anvÃ¤nds i kÃ¤llmeddelandet ocksÃ¥ fÃ¶rekommer i Ã¶versÃ¤ttningen, utan tillÃ¤gg.

source: This check is not applied to Fluent Terms since Terms always have a value, and Term attributes tend to be locale-specific (used for grammar rules, etc.), and are not expected to appear in all translations.
sv: Denna kontroll tillÃ¤mpas inte pÃ¥ flytande termer, eftersom termer alltid har ett vÃ¤rde och termattribut tenderar att vara lokalspecifika (anvÃ¤nds fÃ¶r grammatikregler etc.) och inte fÃ¶rvÃ¤ntas fÃ¶rekomma i alla Ã¶versÃ¤ttningar.

source: A Fluent Message or Term can reference another Message, Term, Attribute, or a variable. For example:
sv: Ett flytande meddelande eller begrepp kan hÃ¤nvisa till ett annat meddelande, begrepp, attribut eller en variabel. Till exempel:

source: Generally, translated Messages or Terms are expected to contain the same references as the source, although not necessarily in the same order of appearance. So this check ensures that translations use the same references in their value as the source value, the same number of times, and with no additions. For Messages, this will also check that each Attribute in the translation uses the same references as the matching Attribute in the source.
sv: I allmÃ¤nhet fÃ¶rvÃ¤ntas Ã¶versatta meddelanden eller termer innehÃ¥lla samma referenser som kÃ¤llan, men inte nÃ¶dvÃ¤ndigtvis i samma ordning. Denna kontroll sÃ¤kerstÃ¤ller alltsÃ¥ att Ã¶versÃ¤ttningarna anvÃ¤nder samma referenser i sitt vÃ¤rde som kÃ¤llvÃ¤rdet, samma antal gÃ¥nger och utan tillÃ¤gg. FÃ¶r meddelanden kontrolleras ocksÃ¥ att varje attribut i Ã¶versÃ¤ttningen anvÃ¤nder samma referenser som motsvarande attribut i kÃ¤llan.

source: When the source or translation contains Fluent Select Expressions, then each possible variant in the source must be matched with at least one variant in the translation with the same references, and vice versa.
sv: NÃ¤r kÃ¤lltexten eller Ã¶versÃ¤ttningen innehÃ¥ller Fluent Select Expressions mÃ¥ste varje mÃ¶jlig variant i kÃ¤lltexten matchas med minst en variant i Ã¶versÃ¤ttningen med samma referenser, och vice versa.

source: Moreover, if a variable reference appears both in the Select Expression's selector and within one of its variants, then all variants may also be considered as if they also contain that reference. The assumption being that the variant's key may have made the reference redundant for that variant. For example:
sv: Om en variabelreferens fÃ¶rekommer bÃ¥de i Select Expression-vÃ¤ljaren och i en av dess varianter, kan dessutom alla varianter betraktas som om de ocksÃ¥ innehÃ¥ller den referensen. Antagandet Ã¤r att variantens nyckel kan ha gjort referensen Ã¶verflÃ¶dig fÃ¶r den varianten. Till exempel:

source: Here, for the purposes of this check, the ``[one]`` variant will also be considered to contain the ``$num`` reference.
sv: HÃ¤r, fÃ¶r denna kontroll, kommer varianten ``[one]`` ocksÃ¥ att anses innehÃ¥lla referensen ``$num``.

source: However, a reference within the Select Expression's selector, which can only be a variable of a Term Attribute in Fluent's syntax, will not by itself count as a required reference because they do not form the actual text content of the string that the end-user will see, and the presence of a Select Expression is considered locale-specific. For example:
sv: En referens inom Select Expression-selektorn, som endast kan vara en variabel av ett Term Attribute i Fluents syntax, rÃ¤knas dock inte i sig som en obligatorisk referens, eftersom den inte utgÃ¶r det faktiska textinnehÃ¥llet i den strÃ¤ng som slutanvÃ¤ndaren ser, och fÃ¶rekomsten av en Select Expression anses vara lokaliseringsspecifik. Till exempel:

source: Here a reference to ``-term.starts-with-vowel`` is not expected to appear in translations, but a reference to ``-term`` is.
sv: HÃ¤r fÃ¶rvÃ¤ntas inte en hÃ¤nvisning till ``-term.starts-with-vowel`` fÃ¶rekomma i Ã¶versÃ¤ttningarna, men en hÃ¤nvisning till ``-term`` fÃ¶rvÃ¤ntas fÃ¶rekomma.

source: This check will verify that the translated value of a Message or Term contains the same HTML elements as the source value.
sv: Denna kontroll verifierar att det Ã¶versatta vÃ¤rdet fÃ¶r ett meddelande eller en term innehÃ¥ller samma HTML-element som kÃ¤llvÃ¤rdet.

source: First, if the source value fails the :ref:`check-fluent-source-inner-html` check, then this check will do nothing. Otherwise, the translated value will also be checked under the same conditions.
sv: FÃ¶r det fÃ¶rsta, om kÃ¤llvÃ¤rdet inte klarar :ref:`check-fluent-source-inner-html`-kontrollen, kommer denna kontroll inte att gÃ¶ra nÃ¥got. I annat fall kommer det Ã¶versatta vÃ¤rdet ocksÃ¥ att kontrolleras under samma villkor.

source: Second, the HTML elements found in the translated value will be compared against the HTML elements found in the source value. Two elements will match if they share the exact same tag name, the exact same attributes and values, and all their ancestors match in the same way. This check will ensure that all the elements in the source appear somewhere in the translation, with the same *number* of appearances, and with no additional elements added. When there are multiple elements in the value, they need not appear in the same order in the translation value.
sv: FÃ¶r det andra kommer HTML-elementen som finns i det Ã¶versatta vÃ¤rdet att jÃ¤mfÃ¶ras med HTML-elementen som finns i kÃ¤llvÃ¤rdet. TvÃ¥ element matchar varandra om de har exakt samma taggnamn, exakt samma attribut och vÃ¤rden, och alla deras Ã¶verordnade element matchar varandra pÃ¥ samma sÃ¤tt. Denna kontroll sÃ¤kerstÃ¤ller att alla element i kÃ¤llan fÃ¶rekommer nÃ¥gonstans i Ã¶versÃ¤ttningen, med samma *antal* fÃ¶rekomster och utan att nÃ¥gra ytterligare element har lagts till. NÃ¤r det finns flera element i vÃ¤rdet behÃ¶ver de inte fÃ¶rekomma i samma ordning i Ã¶versÃ¤ttningsvÃ¤rdet.

source: When the source or translation contains Fluent Select Expressions, then each possible variant in the source must be matched with at least one variant in the translation with the same HTML elements, and vice versa.
sv: NÃ¤r kÃ¤lltexten eller Ã¶versÃ¤ttningen innehÃ¥ller Fluent Select Expressions mÃ¥ste varje mÃ¶jlig variant i kÃ¤lltexten matchas med minst en variant i Ã¶versÃ¤ttningen med samma HTML-element, och vice versa.

source: When using Fluent in combination with the Fluent DOM package, this check will ensure that the translation also includes any required ``data-l10n-name`` elements that appear in the source, or any of the allowed inline elements like ``<br>``.
sv: NÃ¤r Fluent anvÃ¤nds i kombination med Fluent DOM-paketet sÃ¤kerstÃ¤ller denna kontroll att Ã¶versÃ¤ttningen Ã¤ven inkluderar alla nÃ¶dvÃ¤ndiga ``data-l10n-name``-element som fÃ¶rekommer i kÃ¤lltexten, eller nÃ¥got av de tillÃ¥tna inline-elementen som ``<br>``.

source: For example, the following source:
sv: Till exempel fÃ¶ljande kÃ¤lla:

source: would match with:
sv: skulle matcha med:

source: but not:
sv: men inte:

source: nor
sv: inte heller

source: In Weblate, Fluent strings use Fluent syntax for references and variables, but also for more complex features like defining attributes and selector variants, including plurals. This check ensures that the syntax used in the translation will be valid for Fluent.
sv: I Weblate anvÃ¤nder Fluent-strÃ¤ngar Fluent-syntax fÃ¶r referenser och variabler, men ocksÃ¥ fÃ¶r mer komplexa funktioner som att definiera attribut och selektorsvarianter, inklusive pluralformer. Denna kontroll sÃ¤kerstÃ¤ller att syntaxen som anvÃ¤nds i Ã¶versÃ¤ttningen Ã¤r giltig fÃ¶r Fluent.

source: Formatted strings
sv: Formaterade strÃ¤ngar

source: Checks that the formatting in strings is replicated between both source and translation. Omitting format strings in translation usually causes severe problems, so the formatting in strings should usually match the source.
sv: Kontrollerar att formateringen i strÃ¤ngar replikeras mellan bÃ¥de kÃ¤llan och Ã¶versÃ¤ttningen. Att utelÃ¤mna formatstrÃ¤ngar i Ã¶versÃ¤ttningen orsakar vanligtvis allvarliga problem, sÃ¥ formateringen i strÃ¤ngar bÃ¶r vanligtvis matcha kÃ¤llan.

source: Weblate supports checking format strings in several languages. The check is not enabled automatically, only if a string is flagged appropriately (e.g. `c-format` for C format). Gettext adds this automatically, but you will probably have to add it manually for other file formats or if your PO files are not generated by :program:`xgettext`.
sv: Weblate stÃ¶der kontroll av formatstrÃ¤ngar pÃ¥ flera sprÃ¥k. Kontrollen aktiveras inte automatiskt, utan endast om en strÃ¤ng Ã¤r korrekt flaggad (t.ex. `c-format` fÃ¶r C-format). Gettext lÃ¤gger till detta automatiskt, men du mÃ¥ste troligen lÃ¤gga till det manuellt fÃ¶r andra filformat eller om dina PO-filer inte genereras av :program:`xgettext`.

source: Most of the format checks allow omitting format strings for plural forms having a single count. This allows translators to write nicer strings for these cases (`One apple` instead of `%d apple`). Turn this off by adding ``strict-format`` flag.
sv: De flesta formatkontroller tillÃ¥ter att formatstrÃ¤ngar fÃ¶r pluralformer med ett enda antal utelÃ¤mnas. Detta gÃ¶r det mÃ¶jligt fÃ¶r Ã¶versÃ¤ttare att skriva snyggare strÃ¤ngar fÃ¶r dessa fall (`Ett Ã¤pple` istÃ¤llet fÃ¶r `%d Ã¤pple`). Inaktivera detta genom att lÃ¤gga till flaggan ``strict-format``.

source: The flags can be customized per string (see :ref:`additional`) or in a :ref:`component`. Having it defined per component is simpler, but it can lead to false positives in case the string is not interpreted as a formatting string, but format string syntax happens to be used.
sv: Flaggorna kan anpassas per strÃ¤ng (se :ref:`additional`) eller i en :ref:`component`. Att definiera dem per komponent Ã¤r enklare, men det kan leda till falska positiva resultat om strÃ¤ngen inte tolkas som en formateringsstrÃ¤ng, men formateringsstrÃ¤ngsyntax rÃ¥kar anvÃ¤ndas.

source: In case specific format check is not available in Weblate, you can use generic :ref:`check-placeholders`.
sv: Om specifik formatkontroll inte Ã¤r tillgÃ¤nglig i Weblate kan du anvÃ¤nda generiska :ref:`check-placeholders`.

source: Besides checking, this will also highlight the formatting strings to easily insert them into translated strings:
sv: FÃ¶rutom att kontrollera kommer detta ocksÃ¥ att markera formateringsstrÃ¤ngarna sÃ¥ att de enkelt kan infogas i Ã¶versatta strÃ¤ngar:

source: Named format string example
sv: Exempel pÃ¥ namngiven formatstrÃ¤ng

source: `AngularJS text interpolation <https://angular.io/guide/interpolation>`_
sv: `AngularJS textinterpolering <https://angular.io/guide/interpolation>`_

source: Simple format string example
sv: Enkelt exempel pÃ¥ formatstrÃ¤ng

source: `Interpolate Components <https://github.com/Automattic/wp-calypso/tree/trunk/packages/interpolate-components>`_
sv: `Interpolera komponenter <https://github.com/Automattic/wp-calypso/tree/trunk/packages/interpolate-components>`_

source: Position format string example
sv: Exempel pÃ¥ positionsformatstrÃ¤ng

source: `C format strings <https://www.gnu.org/software/gettext/manual/html_node/c_002dformat.html>`_
sv: `C-formatstrÃ¤ngar <https://www.gnu.org/software/gettext/manual/html_node/c_002dformat.html>`_

source: Interpolation example
sv: Interpolationsexempel

source: `Template literals <https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Template_literals>`_
sv: `Mall-literaler <https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Template_literals>`_

source: Nesting example
sv: Exempel pÃ¥ kapsling

source: This check has support for both pure ICU MessageFormat messages as well as ICU with simple XML tags. You can configure the behavior of this check by using ``icu-flags:*``, either by opting into XML support or by disabling certain sub-checks. For example, the following flag enables XML support while disabling validation of plural sub-messages:
sv: Denna kontroll stÃ¶der bÃ¥de rena ICU MessageFormat-meddelanden och ICU med enkla XML-taggar. Du kan konfigurera beteendet fÃ¶r denna kontroll med hjÃ¤lp av ``icu-flags:*``, antingen genom att vÃ¤lja XML-stÃ¶d eller genom att inaktivera vissa underkontroller. Till exempel aktiverar fÃ¶ljande flagga XML-stÃ¶d samtidigt som validering av pluralundermeddelanden inaktiveras:

source: Enable support for simple XML tags. By default, XML tags are parsed loosely. Stray ``<`` characters are ignored if they are not reasonably part of a tag.
sv: Aktivera stÃ¶d fÃ¶r enkla XML-taggar. Som standard analyseras XML-taggar lÃ¶st. Enstaka ``<``-tecken ignoreras om de inte rimligen ingÃ¥r i en tagg.

source: Enable support for strict XML tags. All ``<`` characters must be escaped if they are not part of a tag.
sv: Aktivera stÃ¶d fÃ¶r strikta XML-taggar. Alla ``<``-tecken mÃ¥ste undantas om de inte ingÃ¥r i en tagg.

source: Disable highlighting placeholders in the editor.
sv: Inaktivera markering av platshÃ¥llare i redigeraren.

source: Disable requiring sub-messages to have an ``other`` selector.
sv: Inaktivera kravet pÃ¥ att undermeddelanden mÃ¥ste ha en ``annan`` selektor.

source: Skip checking that sub-message selectors match the source.
sv: Hoppa Ã¶ver kontrollen av att delmeddelandeselektorer matchar kÃ¤llan.

source: Skip checking that placeholder types match the source.
sv: Hoppa Ã¶ver kontrollen av att platshÃ¥llartyperna stÃ¤mmer Ã¶verens med kÃ¤llan.

source: Skip checking that no placeholders are present that were not present in the source string.
sv: Hoppa Ã¶ver kontrollen av att det inte finns nÃ¥gra platshÃ¥llare som inte fanns i kÃ¤llstrÃ¤ngen.

source: Skip checking that no placeholders are missing that were present in the source string.
sv: Hoppa Ã¶ver kontrollen av att inga platshÃ¥llare som fanns i kÃ¤llstrÃ¤ngen saknas.

source: Additionally, when ``strict-xml`` is not enabled but ``xml`` is enabled, you can use the ``icu-tag-prefix:PREFIX`` flag to require that all XML tags start with a specific string. For example, the following flag will only allow XML tags to be matched if they start with ``<x:``:
sv: Dessutom, nÃ¤r ``strict-xml`` inte Ã¤r aktiverat men ``xml`` Ã¤r aktiverat, kan du anvÃ¤nda flaggan ``icu-tag-prefix:PREFIX`` fÃ¶r att krÃ¤va att alla XML-taggar bÃ¶rjar med en specifik strÃ¤ng. Till exempel tillÃ¥ter fÃ¶ljande flagga endast XML-taggar som bÃ¶rjar med ``<x:``:

source: This would match ``<x:link>click here</x:link>`` but not ``<strong>this</strong>``.
sv: Detta skulle matcha ``<x:link>klicka hÃ¤r</x:link>`` men inte ``<strong>detta</strong>``.

source: `ICU: Formatting Messages <https://unicode-org.github.io/icu/userguide/format_parse/messages/>`_
sv: `ICU: Formatering av meddelanden <https://unicode-org.github.io/icu/userguide/format_parse/messages/>`_

source: `Format.JS: Message Syntax <https://formatjs.github.io/docs/core-concepts/icu-syntax>`_
sv: `Format.JS: Meddelandesyntax <https://formatjs.github.io/docs/core-concepts/icu-syntax>`_

source: This used to be toggled by the ``java-format`` flag, it was changed for consistency with GNU gettext.
sv: Detta brukade aktiveras med flaggan ``java-format``, men Ã¤ndrades fÃ¶r att Ã¶verensstÃ¤mma med GNU gettext.

source: `Java Format Strings <https://docs.oracle.com/javase/7/docs/api/java/util/Formatter.html>`_
sv: `Java-formatstrÃ¤ngar <https://docs.oracle.com/javase/7/docs/api/java/util/Formatter.html>`_

source: ``java-format``, ``auto-java-messageformat`` enables check only if there is a format string in the source
sv: ``java-format``, ``auto-java-messageformat`` aktiverar endast kontroll om det finns en formatstrÃ¤ng i kÃ¤llan

source: This used to be toggled by ``java-messageformat`` flag, it was changed for consistency with GNU gettext.
sv: Detta brukade aktiveras med flaggan ``java-messageformat``, men Ã¤ndrades fÃ¶r att Ã¶verensstÃ¤mma med GNU gettext.

source: This check validates that format string is valid for the Java MessageFormat class. Besides matching format strings in the curly braces, it also verifies single quotes as they have a special meaning. Whenever writing single quote, it should be written as ``''``. When not paired, it is treated as beginning of quoting and will not be shown when rendering the string.
sv: Denna kontroll validerar att formatstrÃ¤ngen Ã¤r giltig fÃ¶r klassen Java MessageFormat. FÃ¶rutom att matcha formatstrÃ¤ngar inom klamrarna, verifierar den Ã¤ven enkla citattecken eftersom de har en speciell betydelse. NÃ¤r du skriver ett enkelt citattecken ska det skrivas som ``''``. NÃ¤r det inte Ã¤r parat behandlas det som bÃ¶rjan pÃ¥ ett citat och visas inte nÃ¤r strÃ¤ngen renderas.

source: `JavaScript formatting strings <https://www.gnu.org/software/gettext/manual/html_node/javascript_002dformat.html>`_
sv: `JavaScript-formateringsstrÃ¤ngar <https://www.gnu.org/software/gettext/manual/html_node/javascript_002dformat.html>`_

source: `Laravel translation formatting <https://laravel.com/docs/localization#replacing-parameters-in-translation-strings>`_
sv: `Laravel-Ã¶versÃ¤ttningsformatering <https://laravel.com/docs/localization#replacing-parameters-in-translation-strings>`_

source: `Lua formatting strings <https://www.gnu.org/software/gettext/manual/html_node/lua_002dformat.html#lua_002dformat>`_
sv: `Lua-formateringsstrÃ¤ngar <https://www.gnu.org/software/gettext/manual/html_node/lua_002dformat.html#lua_002dformat>`_

source: `Object Pascal formatting strings <https://www.gnu.org/software/gettext/manual/html_node/object_002dpascal_002dformat.html#object_002dpascal_002dformat>`_
sv: `Objekt Pascal-formateringsstrÃ¤ngar <https://www.gnu.org/software/gettext/manual/html_node/object_002dpascal_002dformat.html#object_002dpascal_002dformat>`_

source: `Free Pascal formatting strings <https://www.freepascal.org/docs-html/rtl/sysutils/format.html>`_
sv: `Free Pascal-formateringsstrÃ¤ngar <https://www.freepascal.org/docs-html/rtl/sysutils/format.html>`_

source: `Delphi formatting strings <https://docwiki.embarcadero.com/Libraries/Sydney/en/System.SysUtils.Format>`_
sv: `Delphi-formateringsstrÃ¤ngar <https://docwiki.embarcadero.com/Libraries/Sydney/en/System.SysUtils.Format>`_

source: `Perl Format Strings <https://www.gnu.org/software/gettext/manual/html_node/perl_002dformat.html>`_
sv: `Perl-formatstrÃ¤ngar <https://www.gnu.org/software/gettext/manual/html_node/perl_002dformat.html>`_

source: `PHP sprintf documentation <https://www.php.net/manual/en/function.sprintf.php>`_
sv: `PHP sprintf-dokumentation <https://www.php.net/manual/en/function.sprintf.php>`_

source: `PHP Format Strings <https://www.gnu.org/software/gettext/manual/html_node/php_002dformat.html>`_
sv: `PHP-formatstrÃ¤ngar <https://www.gnu.org/software/gettext/manual/html_node/php_002dformat.html>`_

source: Simple format string
sv: Enkel formatstrÃ¤ng

source: :ref:`Python brace format <python:formatstrings>`
sv: :ref:`Python-format fÃ¶r klamrar <python:formatstrings>`

source: `Python Format Strings <https://www.gnu.org/software/gettext/manual/html_node/python_002dformat.html>`_
sv: `Python-formatstrÃ¤ngar <https://www.gnu.org/software/gettext/manual/html_node/python_002dformat.html>`_

source: :ref:`Python string formatting <python:old-string-formatting>`
sv: :ref:`Python-strÃ¤ngformaterings <python:old-string-formatting>`

source: Plural format string example
sv: Exempel pÃ¥ formatstrÃ¤ng i pluralform

source: Named template string
sv: Namngiven mallstrÃ¤ng

source: `Guile Scheme formatted output <https://www.gnu.org/software/guile/manual/html_node/Formatted-Output.html>`_
sv: `Guile Scheme-formaterad utdata <https://www.gnu.org/software/guile/manual/html_node/Formatted-Output.html>`_

source: Named formatting
sv: Namngiven formatering

source: Rails i18n formatting
sv: Rails i18n-formatering

source: Linked locale messages
sv: LÃ¤nkade lokala meddelanden

source: `Vue I18n Formatting <https://kazupon.github.io/vue-i18n/guide/formatting.html>`_
sv: `Vue I18n-formatering <https://kazupon.github.io/vue-i18n/guide/formatting.html>`_

source: `Vue I18n Linked locale messages <https://kazupon.github.io/vue-i18n/guide/messages.html#linked-locale-messages>`_
sv: `Vue I18n LÃ¤nkade lokala meddelanden <https://kazupon.github.io/vue-i18n/guide/messages.html#linked-locale-messages>`_

source: all strings
sv: alla strÃ¤ngar

source: Means a string has been translated already. This can happen when the translations have been reverted in VCS or lost otherwise.
sv: Betyder att en strÃ¤ng redan har Ã¶versatts. Detta kan intrÃ¤ffa nÃ¤r Ã¶versÃ¤ttningarna har Ã¥terstÃ¤llts i VCS eller pÃ¥ annat sÃ¤tt gÃ¥tt fÃ¶rlorade.

source: Weblate checks translations of the same string across all translation within a project to help you keep consistent translations.
sv: Weblate kontrollerar Ã¶versÃ¤ttningar av samma strÃ¤ng i alla Ã¶versÃ¤ttningar inom ett projekt fÃ¶r att hjÃ¤lpa dig att hÃ¥lla Ã¶versÃ¤ttningarna konsekventa.
